:- encoding(utf8).
:- module('20214-VoronovaAS-A4-mod1', [matches_pattern/3, get_form/3]).

matches_pattern(end, Word, 1) :- pattern(1, Forms), member(Word, Forms), !.
matches_pattern(short, Word, 6) :- pattern(6, Forms), member(Word, Forms), !.
matches_pattern(user, Word, Pattern) :- between(1, 9, Pattern), pattern(Pattern, Forms), member(Word, Forms), !.
matches_pattern(period, Word, Pattern) :- between(10, 12, Pattern), pattern(Pattern, Forms), member(Word, Forms), !.
matches_pattern(uncertainty, Word, Pattern) :- between(13, 14, Pattern), pattern(Pattern, Forms), member(Word, Forms), !.
matches_pattern(love, Word, Pattern) :- between(15, 17, Pattern), pattern(Pattern, Forms), member(Word, Forms), !.

get_form(Word, Number, Form) :- pattern(_, Forms), member(Word, Forms), find(Number, Form, Forms).

find(_, "Слово не найдено", []).
find(1, Element, [Element | _]).
find(Number, Word, [_ | List]) :- Number1 is Number - 1, find(Number1, Word, List).

pattern(1, ["пока"]).
pattern(1, ["свидания"]).
pattern(2, ["испытываю"]).
pattern(2, ["чувствую"]).
pattern(3, ["любовь", "любви", "любви", "любовь", "любовью", "любви"]).
pattern(3, ["любить", "люблю", "любит", "любят"]).
pattern(3, ["влюбиться", "влюбился", "влюбилась"]).
pattern(3, ["чувства", "чувств", "чувствам", "чувствами", "чувствах"]).
pattern(4, ["секс", "секса", "сексу", "шваб", "сексом", "сексе"]).
pattern(5, ["бешенство", "бешенства", "бешенству", "бешенство", "бешенством", "бешенстве"]).
pattern(5, ["гнев", "гнева", "гневу", "гнев", "гневом", "гневе"]).
pattern(5, ["ярость", "ярости", "ярости", "яростью", "ярости"]).
pattern(5, ["печаль", "печали", "печали", "печаль", "печалью", "печали"]).
pattern(5, ["одиночество", "одиночества", "одиночеству", "одиночество", "одиночеством", "одиночестве"]).
pattern(5, ["боль", "боли", "боли", "боль", "болью", "боли"]).
pattern(5, ["тоска", "тоски", "тоске", "тоску", "тоской", "тоске"]).
pattern(6, ["да"]).
pattern(6, ["нет"]).
pattern(7, ["комплекс", "комплекса", "комплексу", "комплекс", "комплексом", "комплексе"]).
pattern(7, ["комплексовать", "комплексую"]).
pattern(7, ["фиксация", "фиксации", "фиксации", "фиксацию", "фиксацией", "фиксации"]).
pattern(7, ["фиксироваться", "фиксируюсь"]).
pattern(8, ["всегда"]).
pattern(9, ["отец", "отца", "отцу", "отца", "отцом", "отце"]).
pattern(9, ["мать", "матери", "матери", "мать", "матерью", "матери"]).
pattern(9, ["жена", "жены", "жене", "жену", "женой", "жене"]).
pattern(9, ["муж", "мужа", "мужу", "мужа", "мужем", "муже"]).
pattern(9, ["брат", "брат", "брата", "брату", "братом", "брате"]).
pattern(9, ["сестра", "сестры", "сестре", "сестру", "сестрой", "сестре"]).
pattern(9, ["сын", "сына", "сыну", "сына", "сыном", "сыне"]).
pattern(9, ["дочь", "дочери", "дочери", "дочь", "дочерью", "дочери"]).

pattern(10, ["день", "дня", "дню", "днём", "дне"]).
pattern(10, ["дни", "дней", "дням", "днями", "днях"]).
pattern(10, ["неделя", "недели", "неделе", "неделю", "неделей"]).
pattern(11, ["недели", "недель", "неделям", "неделями", "неделях"]).
pattern(11, ["месяц", "месяца", "месяцу", "месяцем", "месяце"]).
pattern(11, ["месяцы", "месяцев", "месяцам", "месяцы", "месяцами", "месяцах"]).
pattern(11, ["год", "года", "году", "годом", "году"]).
pattern(11, ["годы ", "лет", "годам", "годами", "годах"]).
pattern(12, ["вечность", "вечности", "вечность", "вечностью", "вечности"]).

pattern(13, ["не"]).
pattern(13, ["трудно"]).
pattern(13, ["сложно"]).
pattern(14, ["знаю"]).
pattern(14, ["хочу"]).
pattern(14, ["уверен", "уверена"]).
pattern(14, ["сказать"]).
pattern(14, ["ответить"]).

pattern(15, ["не"]).
pattern(16, ["боюсь"]).
pattern(16, ["пугает"]).
pattern(16, ["беспокоит"]).
pattern(16, ["тревожит"]).
pattern(16, ["безответна", "безответно"]).
pattern(16, ["боль"]).
pattern(16, ["сомнения"]).
pattern(16, ["страх"]).
pattern(17, ["радость"]).
pattern(17, ["рад", "рада"]).
pattern(17, ["счастлив", "счатлива"]).
pattern(17, ["спокойствие"]).
pattern(17, ["взаимопонимание"]).
